package ru.begletsov.job4j_tasks._111_first_programm;

/**
 * @Задание 3.2. Похвали себя за проделанную работу
 * @Описание Напишите программу, которая выводит на консоль строчку "Сегодня я молодец!"
 * @author Sergei Begletsov
 * @since 06.04.2021
 * @version 1
 */

public class CongratulateYourselfForWork_32 {
    public static void main(String[] args) {
        System.out.println("Сегодня я молодец!");
    }
}
